load_test/result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load_test/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 40s max duration (incl. graceful stop):
              * default: 100 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  01.0s/10s

running (02.0s), 100/100 VUs, 7 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  02.0s/10s

running (03.0s), 100/100 VUs, 16 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  03.0s/10s

running (04.0s), 100/100 VUs, 29 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  04.0s/10s

running (05.0s), 100/100 VUs, 50 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  05.0s/10s

running (06.0s), 100/100 VUs, 87 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  06.0s/10s

running (07.0s), 100/100 VUs, 101 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  07.0s/10s

running (08.0s), 100/100 VUs, 162 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  08.0s/10s

running (09.0s), 100/100 VUs, 262 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  09.0s/10s

running (10.0s), 100/100 VUs, 362 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  10.0s/10s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.26s min=33.37ms med=118.93ms max=7.4s p(90)=6.07s p(95)=7.06s
      { expected_response:true }...: avg=1.26s min=33.37ms med=118.93ms max=7.4s p(90)=6.07s p(95)=7.06s
    http_req_failed................: 0.00% 0 out of 462
    http_reqs......................: 462   42.686783/s

    EXECUTION
    iteration_duration.............: avg=2.26s min=1.03s   med=1.11s    max=8.4s p(90)=7.08s p(95)=8.07s
    iterations.....................: 462   42.686783/s
    vus............................: 100   min=100      max=100
    vus_max........................: 100   min=100      max=100

    NETWORK
    data_received..................: 12 MB 1.1 MB/s
    data_sent......................: 32 kB 3.0 kB/s



running (10.8s), 000/100 VUs, 462 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  10s